package com.example.codding;

public class MainController {


/* 자료 잠깐 저장 하고 싶으면 변수 ex) 타입+변수명 = 값;
   타입 적기 귀찮 으면 var 키워드 씀 -알아서 유추해 타입 알려줌.
   앞에 final 붙이면 변경 불가능 (바뀌면 안되는 값) ex) 와이프 수
   특정 조건이 맞을때 만 코드 실행 -> if 조건문
   복붙 하고 싶을땐 ->for 반복문
   코드 재사용 하고 싶으면  ->함수 ex) 클래스 안에 타입+함수 이름(){코드들};  ->사용 할땐 함수 이름(); */

/* class 는 변수 , 함수 보관함 -> 변수 , 함수 쓰려면 class 를 복사 해서 써야함 (new 키워드 사용 ->object 생성)
   class 안 변수 는 필드 , 함수는 메소드 라 부름
   비슷한 class 는 여러개 만들 필요 없다 -> class 똑같은 이름의 함수 (constructor 함수) ->매개 변수 ,this 활용
 */

// 웹서버 는 유저가 웹 페이지 요청(~ 해줘) 하면 해줌.



}
